tutorials/multiphase/lagrangian/pimpleParcelSolver/cyclone/constant/transportProperties
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rhoInf          rhoInf [ 1 -3 0 0 0 0 0 ] 1.2;

transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 6.179e-05;



// ************************************************************************* //
