tutorials/multiphase/lagrangian/pimpleParcelSolver/cyclone/0/k
/*---------------------------------------------------------------------------*\
Caelus 10.04
Web:   www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    body
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.375;
    }
    inlet-walls
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    overflow
    {
        type            zeroGradient;
    }
    underflow
    {
        type            zeroGradient;
    }
    vortexfinder
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
}


// ************************************************************************* //
